#+STARTUP: content indent

*** =init=

- =git init=
- .git ディレクトリが作成される

#+begin_src shell :results silent :session "*git*"
cd =
rm git-test/ -rf
mkdir git-test
cd git-test
#+end_src

#+begin_src shell :session "*git*"
git init
#+end_src

#+RESULTS:
: Initialized empty Git repository in /home/shun/git-test/.git/

#+begin_src shell :session "*git*"
ls -a .git/
#+end_src

#+RESULTS:
: .  ..  branches  config  description  HEAD  hooks  info  objects  refs

#+begin_src shell :results output :session "*git*"
cat .git/config
#+end_src

#+RESULTS:
: [core]
: 	repositoryformatversion = 0
: 	filemode = true
: 	bare = false
: 	logallrefupdates = true

